name = "Алексей"
age = 23
print(
    f"Привет, меня зовут {name}, мне {age} года недавно я погрузился в мир\n программирования чему очень рад и что у меня вызывает дикий интерес\n,я познакомился с такими языками как 'Java Script' и 'Python', это довольно\n интересные языки.\n\t Я очень рад что свое изучение начал с помощью'Академии Top' и у меня\n очень интересный препод,который знает много фич,фишек и тд и пытается дать\n рельно полезные навыки и знания.\n\t Немнго расскажу о себе: я закончил юрфак,люблю читать,люблю психологию, философию,научную литературу и биографию знаменитых людей слушать музыку,\n раньше играл на гитаре,изучаю английский, занимался спортом, но сейчас нет\n времени.\n\t Планирую к зиме начать стажироваться как айти специалист и одновременно закончить годовые курсы по 'Python'. "
)
